Q1. List any five functions of the pandas library with execution.

In [37]:
import numpy as np
import pandas as pd
data={
    "id":[1,2,3,4,5],
    "name":["siva","kumar",np.nan,"reddy","dhanush"],
    "age":[20,21,np.nan,19,np.nan]
}

In [38]:
df=pd.DataFrame(data)

In [39]:
df.head(3)

   id   name   age
0   1   siva  20.0
1   2  kumar  21.0
2   3    NaN   NaN

In [40]:
df.tail(2)

   id     name   age
3   4    reddy  19.0
4   5  dhanush   NaN

In [41]:
df['age'][1:3]

1    21.0
2     NaN
Name: age, dtype: float64

In [42]:
df.iloc[1:3,[0,2]]

   id   age
1   2  21.0
2   3   NaN

In [43]:
df['age']=df['age'].fillna(df['age'].mean())

In [44]:
df

   id     name   age
0   1     siva  20.0
1   2    kumar  21.0
2   3      NaN  20.0
3   4    reddy  19.0
4   5  dhanush  20.0

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [45]:
data={
    'A':[1,2,4,5,6,34],
    'B':[0,1,0,1,0,0],
    'C':[34,54,65,23,56,67]
}

In [55]:
df=pd.DataFrame(data)
df

    A  B   C
0   1  0  34
1   2  1  54
2   4  0  65
3   5  1  23
4   6  0  56
5  34  0  67

In [53]:
df.set_index(np.arange(1,len(df)*2,2),inplace=True)

In [54]:
df

     A  B   C
1    1  0  34
3    2  1  54
5    4  0  65
7    5  1  23
9    6  0  56
11  34  0  67

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [60]:
data={"values":[2,6,5,2,5,45,56,76]}
df=pd.DataFrame(data)

In [61]:
df.loc[0:2].sum()

values    13
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [62]:
data={
    "text":['DataFrame','pandas','numpy','scikitlearn']
}

In [63]:
df=pd.DataFrame(data)

In [65]:
df['Word_Count']=df['text'].apply(lambda x:len(x))

In [66]:
df

          text  Word_Count
0    DataFrame           9
1       pandas           6
2        numpy           5
3  scikitlearn          11

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size returns number of elements present in the dataset whereas DataFrame.shape() returns shape of dataset in the form of tuple. first element in tuple represents numbers of rows and second element represents number of columns.

In [69]:
df.shape

(4, 2)

In [70]:
df.size

8

Q6. Which function of pandas do we use to read an excel file?

pandas.read_csv() function of pandas is used to read csv file.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [71]:
data={
    'Email':['siva@domain.com','puneeth.@domain.com','dhanush@domain.com','vamsi@domain.com']
}

In [72]:
df=pd.DataFrame(data)

In [73]:
df

                 Email
0      siva@domain.com
1  puneeth.@domain.com
2   dhanush@domain.com
3     vamsi@domain.com

In [77]:
df['Username']=df['Email'].str.split('@').str[0]

In [78]:
df

                 Email  Username
0      siva@domain.com      siva
1  puneeth.@domain.com  puneeth.
2   dhanush@domain.com   dhanush
3     vamsi@domain.com     vamsi

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Assignment

Data Science Masters

Your function should select the following rows: A B C
                                              1 8 2 7
                                              4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [79]:
data={
    'A':[3,8,6,2,9],
    'B':[5,2,9,3,1],
    'C':[1,7,4,5,2]
}

In [80]:
df=pd.DataFrame(data)

In [81]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [89]:
df1=df[(df['A']>5) & (df['B']<10)]

In [90]:
df1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [91]:
data={
    'values':[3,4,2,5,1,5,7]
}

In [92]:
df=pd.DataFrame(data)

In [93]:
df

   values
0       3
1       4
2       2
3       5
4       1
5       5
6       7

In [99]:
df.mean()

values    3.857143
dtype: float64

In [95]:
df.median()

values    4.0
dtype: float64

In [97]:
df.std()

values    2.035401
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [100]:
data={
    'Sales':[23,45,67,45,78,23,56],
    'Date':['21-2-2020','22-2-2020','23-2-2020','24-2-2020','25-2-2020','26-2-2020','27-2-2020']
}

In [101]:
df=pd.DataFrame(data)

In [102]:
df

   Sales       Date
0     23  21-2-2020
1     45  22-2-2020
2     67  23-2-2020
3     45  24-2-2020
4     78  25-2-2020
5     23  26-2-2020
6     56  27-2-2020

In [113]:
df['MovingAverage']=df['Sales'].rolling(window=7,min_periods=1).mean()

In [114]:
df

   Sales       Date  MovingAverage
0     23  21-2-2020      23.000000
1     45  22-2-2020      34.000000
2     67  23-2-2020      45.000000
3     45  24-2-2020      45.000000
4     78  25-2-2020      51.600000
5     23  26-2-2020      46.833333
6     56  27-2-2020      48.142857

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [115]:
data={
    'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06','2023-01-07','2023-01-08']
}

In [116]:
df=pd.DataFrame(data)

In [119]:
df['Weekday']=pd.to_datetime(df['Date']).dt.day_name()

In [120]:
df

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday
5  2023-01-06     Friday
6  2023-01-07   Saturday
7  2023-01-08     Sunday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [122]:
start_date=pd.to_datetime('2023-01-01')
end_date=pd.to_datetime('2023-01-31')

In [123]:
data={
    'Date':['2023-01-23','2023-02-24','2023-01-25','2023-01-02','2023-01-03','2023-03-23','2023-04-23']
}

In [124]:
df=pd.DataFrame(data)

In [125]:
df

         Date
0  2023-01-23
1  2023-02-24
2  2023-01-25
3  2023-01-02
4  2023-01-03
5  2023-03-23
6  2023-04-23

In [129]:
df1=df[(pd.to_datetime(df['Date'])>start_date) & (pd.to_datetime(df['Date'])<end_date)]

In [130]:
df1

         Date
0  2023-01-23
2  2023-01-25
3  2023-01-02
4  2023-01-03

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

First, we have to import the pandas library to use the basic functions of pandas.

In [131]:
import pandas